app/views/users/show.html.erb

          <% @follows.each do |follow| %>
            <% user = User.find(follow.follow_id) %>
---
SELECT "follows".* FROM "follows" WHERE "follows"."follow_id" = ?  [["follow_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]