app/views/books/_form.html.erb

        <th>follow</th>
        <td>follows:<%= user.follows.count %> followers:<%= Follow.where(follow_id: user.id).count %></td>
---
SELECT COUNT(*) FROM "follows" WHERE "follows"."follow_id" = ?  [["follow_id", 1]]

          <i class="fa fa-heart" aria-hidden="ture" style="color: red;"></i>
          <% end %> follows:<%= user.follows.count %> followers:<%= Follow.where(follow_id: user.id).count %>
---
SELECT COUNT(*) FROM "follows" WHERE "follows"."follow_id" = ?  [["follow_id", 5]]

          <i class="far fa-heart" aria-hidden="ture" style="color: red;"></i>
          <% end %>  follows:<%= user.follows.count %> followers:<%= Follow.where(follow_id: user.id).count %>
---
SELECT COUNT(*) FROM "follows" WHERE "follows"."follow_id" = ?  [["follow_id", 5]]