app/views/books/show.html.erb

                    <i class="fa fa-heart" aria-hidden="ture" style="color: red;"></i>
                    <%= @books.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

                      <i class="far fa-heart" aria-hidden="true" style="color: red;"></i>
                      <%= @books.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]