app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @books = Book.page(params[:page]).reverse_order

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @books = Book.find(params[:id])
    @book = Book.new
    @user = User.find(@books.user_id)

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaa"], ["body", "システム図解で説明してくれます"], ["user_id", 1], ["created_at", "2019-03-16 07:27:26.164747"], ["updated_at", "2019-03-16 07:27:26.164747"]]
---
  def create
    book = Book.new(book_params)
    book.user_id = current_user.id
    if book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def correct_user
      book = Book.find(params[:id])