app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "user_id", "book_id", "text") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-04-21 02:20:43.829076"], ["updated_at", "2019-04-21 02:20:43.829076"], ["user_id", 1], ["book_id", 1], ["text", "aaaaaaaaaaaaaaaaaaa"]]
---
  def create
    comment = current_user.comments.new(comment_params)
    book = Book.find(params[:book_id])
    comment.book_id = book.id
    comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    comment = Comment.find(params[:id])
    book = comment.book

    if comment.user != current_user
      redirect_to book_path(bood)
    end

    comment.destroy