app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.new
    book = Book.find(params[:book_id])
    favorite.book_id = book.id
    favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["book_id", 3], ["created_at", "2019-04-14 10:30:59.938235"], ["updated_at", "2019-04-14 10:30:59.938235"]]