app/controllers/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "follows" ("user_id", "follow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["follow_id", 5], ["created_at", "2019-04-21 03:19:49.437694"], ["updated_at", "2019-04-21 03:19:49.437694"]]
---
  def create
    follow = current_user.follows.new
    user = User.find(params[:user_id])
    follow.follow_id = user.id
    follow.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."follow_id" = ? LIMIT ?  [["user_id", 1], ["follow_id", 5], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
  def destroy
    user = User.find(params[:user_id])
    follow = current_user.follows.find_by(follow_id: user.id)
    follow.destroy