app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @users = User.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "follows".* FROM "follows" WHERE "follows"."follow_id" = ? ORDER BY "follows"."id" DESC LIMIT ? OFFSET ?  [["follow_id", 5], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "follows" WHERE "follows"."follow_id" = ?  [["follow_id", 5]]
SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? ORDER BY "follows"."id" DESC LIMIT ? OFFSET ?  [["user_id", 5], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.page(params[:page]).reverse_order
    @book = Book.new
    @followers = Follow.where(follow_id: @user.id).page(params[:page]).reverse_order
    @follows = @user.follows.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def correct_user
      user = User.find(params[:id])